---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceSubFolder.Dispose
source: html/3b71f55f-76af-55e2-814b-1dd4553671bb.htm
---
# Autodesk.Revit.DB.ExternalResourceSubFolder.Dispose Method

Releases all resources used by the ExternalResourceSubFolder

## Syntax (C#)
```csharp
public void Dispose()
```